Configuration/Documents/ПодготовкаСпецоценкиУсловийТруда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПодготовкаСпецоценкиУсловийТруда</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиОтветственногоЗаОхрануТруда</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочиеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьРабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПредставлениеРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассУсловийТрудаПоРезультатамПредыдущейОценки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КлассыУсловийТрудаПоРезультатамСпециальнойОценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПредыдущейОценки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АналогичныеМеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьРабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьАналогичноеМесто</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УсловияТруда</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АналогичноеМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УдалитьРабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РабочееМесто</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РабочиеМестаОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтраховойНомерПФР</Name>
							<Comment>АПК:58 различия имени и синонима оправданы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пол</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРождения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Инвалидность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиРабочегоМеста</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комиссия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЧленКомиссии</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Должность</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РольВКомиссии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиЧленовКомиссииОхраныТруда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФизическиеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Configuration/Documents/ПодготовкаСпецоценкиУсловийТруда/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Организация") Тогда
			Организация = ДанныеЗаполнения.Организация;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ЗарплатаКадры.ПроверитьКорректностьДаты(Ссылка, ДатаНачала, "Объект.ДатаНачала", Отказ, НСтр("ru='Дата начала'"), , , Ложь);
	
	ОхранаТруда.ОбработкаПроверкиЗаполненияКомиссии(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
	Если ДатаНачала > ДатаОкончания Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru='Дата окончания не может быть меньше даты начала проведения спецоценки условий труда'"), ЭтотОбъект, "ДатаОкончания", ,Отказ);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("РабочиеМеста", РабочиеМеста.Выгрузить());
	Запрос.УстановитьПараметр("АналогичныеМеста", АналогичныеМеста.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РабочиеМеста.РабочееМесто,
	|	РабочиеМеста.НомерСтроки,
	|	РабочиеМеста.ИдентификаторСтрокиРабочегоМеста
	|ПОМЕСТИТЬ ВТРабочиеМеста
	|ИЗ
	|	&РабочиеМеста КАК РабочиеМеста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналогичныеМеста.ИдентификаторСтрокиРабочегоМеста,
	|	АналогичныеМеста.АналогичноеМесто
	|ПОМЕСТИТЬ ВТАналогичныеМеста
	|ИЗ
	|	&АналогичныеМеста КАК АналогичныеМеста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РабочиеМеста.РабочееМесто,
	|	РабочиеМеста.НомерСтроки,
	|	РабочиеМеста.АналогичноеМесто
	|ИЗ
	|	(ВЫБРАТЬ
	|		РабочиеМеста.РабочееМесто КАК РабочееМесто,
	|		РабочиеМеста.НомерСтроки КАК НомерСтроки,
	|		ЛОЖЬ КАК АналогичноеМесто
	|	ИЗ
	|		ВТРабочиеМеста КАК РабочиеМеста
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРабочиеМеста КАК РабочиеМестаДубль
	|			ПО РабочиеМеста.РабочееМесто = РабочиеМестаДубль.РабочееМесто
	|				И РабочиеМеста.НомерСтроки <> РабочиеМестаДубль.НомерСтроки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РабочиеМеста.РабочееМесто,
	|		РабочиеМеста.НомерСтроки,
	|		ИСТИНА
	|	ИЗ
	|		ВТРабочиеМеста КАК РабочиеМеста
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТАналогичныеМеста КАК АналогичныеМеста
	|			ПО РабочиеМеста.РабочееМесто = АналогичныеМеста.АналогичноеМесто
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		РабочиеМеста.РабочееМесто,
	|		РабочиеМеста.НомерСтроки,
	|		ЛОЖЬ
	|	ИЗ
	|		ВТРабочиеМеста КАК РабочиеМеста
	|	ГДЕ
	|		РабочиеМеста.РабочееМесто = ЗНАЧЕНИЕ(Справочник.РабочиеМестаОхраныТруда.ПустаяСсылка)) КАК РабочиеМеста
	|
	|СГРУППИРОВАТЬ ПО
	|	РабочиеМеста.РабочееМесто,
	|	РабочиеМеста.НомерСтроки,
	|	РабочиеМеста.АналогичноеМесто
	|
	|УПОРЯДОЧИТЬ ПО
	|	РабочиеМеста.РабочееМесто";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.СледующийПоЗначениюПоля("РабочееМесто") Цикл
		Если Выборка.АналогичноеМесто Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Рабочее место ""%1"" используется в строке ""%2""'"),
				Выборка.РабочееМесто,
				Выборка.НомерСтроки);
		ИначеЕсли Не ЗначениеЗаполнено(Выборка.РабочееМесто) Тогда
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Рабочее место ""%1"" не заполнено'"), Выборка.РабочееМесто);
		Иначе
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Рабочее место ""%1"" используется в нескольких строках:'") + " ",
				Выборка.РабочееМесто);
			Пока Выборка.Следующий() Цикл
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1 %2,'"),
					ТекстОшибки,
					Выборка.НомерСтроки);
			КонецЦикла;
			СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекстОшибки, 1);
		КонецЕсли;
		Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("РабочиеМеста", Выборка.НомерСтроки, "РабочееМесто");
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , Поле, "Объект", Отказ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьАналогичныеРабочиеМеста(ИдентификаторыРабочихМест) Экспорт
	
	АналогичныеМеста.Очистить();
	
	Для Каждого СтрокаРабочегоМеста Из РабочиеМеста Цикл
		МассивАналогичныхРабочихМест = ИдентификаторыРабочихМест.Получить(СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста);
		Если МассивАналогичныхРабочихМест = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого АналогичноеМесто Из МассивАналогичныхРабочихМест Цикл
			НоваяСтрока = АналогичныеМеста.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста;
			НоваяСтрока.АналогичноеМесто = АналогичноеМесто;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьСотрудников(ИдентификаторыСотрудников) Экспорт
	
	Сотрудники.Очистить();
	
	Для Каждого СтрокаРабочегоМеста Из РабочиеМеста Цикл
		МассивСотрудников = ИдентификаторыСотрудников.Получить(СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста);
		Если МассивСотрудников = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого ДанныеСотрудника Из МассивСотрудников Цикл
			НоваяСтрока = Сотрудники.Добавить();
			НоваяСтрока.ИдентификаторСтрокиРабочегоМеста = СтрокаРабочегоМеста.ИдентификаторСтрокиРабочегоМеста;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСотрудника);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
